In [1]:
import pandas as pd

In [2]:
sa_weather = pd.DataFrame({
    'city': ['JHB', 'PTA', 'CPT'],
    'temperature': [32, 45, 30],
    'humidity': [80, 60, 78]
})

In [3]:
usa_weather = pd.DataFrame({
    'city': ['NY', 'LA', 'NJ'],
    'temperature': [21, 14, 35],
    'humidity': [68, 65, 75]
})

In [4]:
sa_weather

  city  temperature  humidity
0  JHB           32        80
1  PTA           45        60
2  CPT           30        78

In [5]:
usa_weather

  city  temperature  humidity
0   NY           21        68
1   LA           14        65
2   NJ           35        75

In [7]:
df = pd.concat([sa_weather, usa_weather], ignore_index=True)

In [8]:
df

  city  temperature  humidity
0  JHB           32        80
1  PTA           45        60
2  CPT           30        78
3   NY           21        68
4   LA           14        65
5   NJ           35        75

In [10]:
new_df = pd.concat([sa_weather, usa_weather], keys=['sa', 'usa'])
new_df

      city  temperature  humidity
sa  0  JHB           32        80
    1  PTA           45        60
    2  CPT           30        78
usa 0   NY           21        68
    1   LA           14        65
    2   NJ           35        75

In [12]:
new_df.loc['sa']

  city  temperature  humidity
0  JHB           32        80
1  PTA           45        60
2  CPT           30        78